{"<s>": 0, "<pad>": 1, "</s>": 2, "<unk>": 3, "#": 4, "(": 5, ")": 6, "-": 7, ".": 8, "1": 9, "2": 10, "3": 11, "4": 12, "5": 13, "6": 14, "7": 15, "8": 16, "9": 17, "=": 18, "B": 19, "Br": 20, "C": 21, "Cl": 22, "F": 23, "I": 24, "N": 25, "O": 26, "P": 27, "S": 28, "[Ag+2]": 29, "[Ag+]": 30, "[Ag-]": 31, "[Ag]": 32, "[Al+2]": 33, "[Al+3]": 34, "[Al+]": 35, "[AlH2-]": 36, "[AlH3]": 37, "[AlH4-]": 38, "[AlH]": 39, "[Al]": 40, "[Ar]": 41, "[As+]": 42, "[As]": 43, "[Au-]": 44, "[Au]": 45, "[B+2]": 46, "[B+3]": 47, "[B+]": 48, "[B-]": 49, "[BH-]": 50, "[BH3-]": 51, "[BH4-]": 52, "[BH]": 53, "[Ba+2]": 54, "[Ba]": 55, "[Be+2]": 56, "[Bi+3]": 57, "[Bi]": 58, "[Br+2]": 59, "[Br+]": 60, "[Br-]": 61, "[C+4]": 62, "[C+]": 63, "[C-]": 64, "[CH+]": 65, "[CH-]": 66, "[CH2+]": 67, "[CH2-]": 68, "[CH2]": 69, "[CH3+]": 70, "[CH3]": 71, "[Ca+2]": 72, "[Ca]": 73, "[Cd+2]": 74, "[Cd+]": 75, "[Cd]": 76, "[Ce+2]": 77, "[Ce+3]": 78, "[Ce+4]": 79, "[Ce]": 80, "[Cl+2]": 81, "[Cl+3]": 82, "[Cl+]": 83, "[Cl-]": 84, "[Co+2]": 85, "[Co+3]": 86, "[Co+]": 87, "[Co]": 88, "[Cr+2]": 89, "[Cr+3]": 90, "[Cr+6]": 91, "[Cr]": 92, "[Cs+]": 93, "[Cs]": 94, "[Cu+2]": 95, "[Cu+3]": 96, "[Cu+]": 97, "[Cu]": 98, "[Dy+3]": 99, "[Eu+3]": 100, "[F-]": 101, "[Fe+2]": 102, "[Fe+3]": 103, "[Fe-3]": 104, "[Fe-4]": 105, "[Fe]": 106, "[Ga+2]": 107, "[Ga+3]": 108, "[Ga+]": 109, "[Ga]": 110, "[GeH4]": 111, "[GeH]": 112, "[Ge]": 113, "[H+]": 114, "[H-]": 115, "[H]": 116, "[He]": 117, "[Hf+4]": 118, "[Hf]": 119, "[Hg+2]": 120, "[Hg+]": 121, "[Hg]": 122, "[I+2]": 123, "[I+3]": 124, "[I+]": 125, "[I-]": 126, "[IH+]": 127, "[IH2+3]": 128, "[IH2+]": 129, "[IH2]": 130, "[IH]": 131, "[In+3]": 132, "[In+]": 133, "[In]": 134, "[Ir]": 135, "[K+]": 136, "[KH]": 137, "[K]": 138, "[La+3]": 139, "[La]": 140, "[Li+]": 141, "[LiH]": 142, "[Li]": 143, "[Mg+2]": 144, "[Mg+]": 145, "[Mg]": 146, "[Mn+2]": 147, "[Mn+3]": 148, "[Mn]": 149, "[Mo]": 150, "[N+3]": 151, "[N+]": 152, "[N-]": 153, "[NH+]": 154, "[NH-]": 155, "[NH2+]": 156, "[NH2-]": 157, "[NH3+]": 158, "[NH4+]": 159, "[Na+]": 160, "[Na]": 161, "[Nd+3]": 162, "[Nd+]": 163, "[Nd]": 164, "[Ni+2]": 165, "[Ni+3]": 166, "[Ni+]": 167, "[Ni]": 168, "[O+]": 169, "[O-]": 170, "[OH+]": 171, "[OH-]": 172, "[OH2+]": 173, "[OH]": 174, "[Os]": 175, "[P+3]": 176, "[P+5]": 177, "[P+]": 178, "[P-]": 179, "[PH+]": 180, "[PH2+]": 181, "[PH2]": 182, "[PH3+]": 183, "[PH3]": 184, "[PH4+]": 185, "[PH4]": 186, "[PH5]": 187, "[PH]": 188, "[Pb+2]": 189, "[Pb+3]": 190, "[Pb+4]": 191, "[Pb]": 192, "[Pd+2]": 193, "[Pd+]": 194, "[Pd-2]": 195, "[Pd-4]": 196, "[Pd-]": 197, "[PdH2]": 198, "[Pd]": 199, "[Pr+3]": 200, "[Pt+2]": 201, "[Pt+3]": 202, "[Pt-]": 203, "[Pt]": 204, "[Rb+]": 205, "[Re]": 206, "[Rh+2]": 207, "[Rh+3]": 208, "[Rh+]": 209, "[Rh]": 210, "[Ru+2]": 211, "[Ru-2]": 212, "[RuH3]": 213, "[Ru]": 214, "[S+]": 215, "[S-]": 216, "[SH+]": 217, "[SH-]": 218, "[SH2+]": 219, "[SH2]": 220, "[SH3+]": 221, "[SH]": 222, "[Sb+5]": 223, "[Sb]": 224, "[Sc+3]": 225, "[Sc]": 226, "[Se-]": 227, "[SeH-]": 228, "[SeH]": 229, "[Se]": 230, "[Si+]": 231, "[Si-]": 232, "[SiH2]": 233, "[SiH3]": 234, "[SiH4]": 235, "[SiH]": 236, "[Si]": 237, "[Sm+2]": 238, "[Sm+3]": 239, "[Sm]": 240, "[Sn+2]": 241, "[Sn+3]": 242, "[Sn+4]": 243, "[Sn+]": 244, "[SnH2]": 245, "[SnH3]": 246, "[SnH4]": 247, "[SnH]": 248, "[Sn]": 249, "[Sr+2]": 250, "[Sr]": 251, "[Ta+2]": 252, "[Ta+5]": 253, "[TaH3]": 254, "[Ta]": 255, "[Te]": 256, "[Ti+2]": 257, "[Ti+3]": 258, "[Ti+4]": 259, "[Ti+5]": 260, "[Ti+]": 261, "[Ti]": 262, "[Tl+2]": 263, "[Tl+3]": 264, "[Tl+]": 265, "[Tl]": 266, "[V+3]": 267, "[V+4]": 268, "[V]": 269, "[W]": 270, "[Xe]": 271, "[Y+3]": 272, "[Yb+3]": 273, "[Yb]": 274, "[Zn+2]": 275, "[Zn+]": 276, "[Zn]": 277, "[Zr+2]": 278, "[Zr+3]": 279, "[Zr+4]": 280, "[Zr+]": 281, "[Zr]": 282, "[c+]": 283, "[c-]": 284, "[n+]": 285, "[n-]": 286, "[nH+]": 287, "[nH]": 288, "[o+]": 289, "[s+]": 290, "[sH+]": 291, "[se]": 292, "b": 293, "c": 294, "n": 295, "o": 296, "p": 297, "s": 298}